tests/facade/epa/message.xml

<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <phrs:ContextHeader xmlns:phrs="http://ws.gematik.de/conn/phrs/PHRService/v1.3">
      <conn:Context xmlns:conn="http://ws.gematik.de/conn/ConnectorContext/v2.0">
        <com:MandantId xmlns:com="http://ws.gematik.de/conn/ConnectorCommon/v5.0">m1</com:MandantId>
        <com:ClientSystemId xmlns:com="http://ws.gematik.de/conn/ConnectorCommon/v5.0">c1</com:ClientSystemId>
        <com:WorkplaceId xmlns:com="http://ws.gematik.de/conn/ConnectorCommon/v5.0">w1</com:WorkplaceId>
      </conn:Context>
      <phrs:RecordIdentifier>
        <phr:InsurantId xmlns:phr="http://ws.gematik.de/fa/phr/v1.1" root="1.2.276.0.76.4.8" extension="X110476138"/>
        <phr:HomeCommunityId xmlns:phr="http://ws.gematik.de/fa/phr/v1.1">urn:oid:1.2.276.0.76.3.1.315.3.3.1.1</phr:HomeCommunityId>
      </phrs:RecordIdentifier>
    </phrs:ContextHeader>
    <wa:Action xmlns:wa="http://www.w3.org/2005/08/addressing">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</wa:Action>
    <wa:MessageID xmlns:wa="http://www.w3.org/2005/08/addressing">8eeec9de-73d9-456c-97e8-8e46bee9f1c9</wa:MessageID>
    <wa:To xmlns:wa="http://www.w3.org/2005/08/addressing">https://tig.spilikin.dev/ws/PHRService</wa:To>
    <wa:ReplyTo xmlns:wa="http://www.w3.org/2005/08/addressing">
      <wa:Address>http://www.w3.org/2005/08/addressing/anonymous</wa:Address>
    </wa:ReplyTo>
    <xdr:homeCommunityBlock xmlns:xdr="urn:ihe:iti:xdr:2014">
      <xdr:homeCommunityId>urn:oid:1.2.276.0.76.3.1.315.3.3.1.1</xdr:homeCommunityId>
    </xdr:homeCommunityBlock>
  </soap12:Header>
  <soap12:Body>
    <xdsb:ProvideAndRegisterDocumentSetRequest xmlns:xdsb="urn:ihe:iti:xds-b:2007">
      <lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0">
        <rs:RequestSlotList xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0">
          <rim:Slot xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0" name="homeCommunityId">
            <rim:ValueList>
              <rim:Value>urn:oid:1.2.276.0.76.3.1.315.3.3.1.1</rim:Value>
            </rim:ValueList>
          </rim:Slot>
        </rs:RequestSlotList>
        <rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
          <rim:RegistryPackage id="submissionset" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage" home="urn:oid:1.2.276.0.76.3.1.315.3.3.1.1">
            <rim:Slot name="submissionTime">
              <rim:ValueList>
                <rim:Value>20231008081620</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="submissionset" id="author" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="authorRole">
                <rim:ValueList>
                  <rim:Value>11^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Slot name="authorPerson">
                <rim:ValueList>
                  <rim:Value>^&#214;zdemir^Simon^^^Freiherr^^^</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Slot name="authorInstitution">
                <rim:ValueList>
                  <rim:Value>Praxis Simon Freiherr &#214;zdemirTEST-ONLY^^^^^&amp;1.2.276.0.76.4.188&amp;ISO^^^^1-SMC-B-Testkarte-883110000096089</rim:Value>
                </rim:ValueList>
              </rim:Slot>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="submissionset" id="contentType" nodeRepresentation="8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.3.6.1.4.1.19376.3.276.1.5.12</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Veranlassung durch Patient" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classifiedObject="submissionset" id="SubmissionSetClassification" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
            <rim:ExternalIdentifier id="patientId" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="submissionset" value="X110476138^^^&amp;1.2.276.0.76.4.8&amp;ISO">
              <rim:Name>
                <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
            <rim:ExternalIdentifier id="uniqueId" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="submissionset" value="2.25.53701503271998679046564345390462649246">
              <rim:Name>
                <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
          </rim:RegistryPackage>
          <rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" id="association-0" sourceObject="submissionset" targetObject="DocumentEntry-0">
            <rim:Slot name="SubmissionSetStatus">
              <rim:ValueList>
                <rim:Value>Original</rim:Value>
              </rim:ValueList>
            </rim:Slot>
          </rim:Association>
          <rim:ExtrinsicObject id="DocumentEntry-0" mimeType="application/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" home="urn:oid:1.2.276.0.76.3.1.315.3.3.1.1">
            <rim:Slot name="creationTime">
              <rim:ValueList>
                <rim:Value>20231008081620</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Slot name="languageCode">
              <rim:ValueList>
                <rim:Value>de-DE</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Slot name="URI">
              <rim:ValueList>
                <rim:Value>hello.txt</rim:Value>
              </rim:ValueList>
            </rim:Slot>
            <rim:Name>
              <rim:LocalizedString value="PsSim: Medikationsplan" xml:lang="de-DE"/>
            </rim:Name>
            <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="DocumentEntry-0" id="class-0" nodeRepresentation="PLA" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.3.6.1.4.1.19376.3.276.1.5.8</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Planungsdokument" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="DocumentEntry-0" id="confidentiality-0" nodeRepresentation="LEI" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.2.276.0.76.5.491</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Dokument einer Leistungserbringerinstitution" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="DocumentEntry-0" id="formatCode-0" nodeRepresentation="urn:gematik:ig:Medikationsplan:r3.1" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.3.6.1.4.1.19376.3.276.1.5.6</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Medikationsplan (gematik)" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="DocumentEntry-0" id="healthCare-0" nodeRepresentation="PRA" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.3.6.1.4.1.19376.3.276.1.5.2</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Arztpraxis" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="DocumentEntry-0" id="author-0" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="authorRole">
                <rim:ValueList>
                  <rim:Value>11^^^&amp;1.3.6.1.4.1.19376.3.276.1.5.13&amp;ISO</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Slot name="authorPerson">
                <rim:ValueList>
                  <rim:Value>^&#214;zdemir^Simon^^^Freiherr^^^</rim:Value>
                </rim:ValueList>
              </rim:Slot>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="DocumentEntry-0" id="practiceSettingCode-0" nodeRepresentation="ALLG" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.3.6.1.4.1.19376.3.276.1.5.4</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Allgemeinmedizin" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="DocumentEntry-0" id="typeCode-0" nodeRepresentation="MEDI" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
              <rim:Slot name="codingScheme">
                <rim:ValueList>
                  <rim:Value>1.3.6.1.4.1.19376.3.276.1.5.9</rim:Value>
                </rim:ValueList>
              </rim:Slot>
              <rim:Name>
                <rim:LocalizedString value="Medikament&#246;se Therapien" xml:lang="de-DE"/>
              </rim:Name>
            </rim:Classification>
            <rim:ExternalIdentifier id="patientId-0" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="DocumentEntry-0" value="X110476138^^^&amp;1.2.276.0.76.4.8&amp;ISO">
              <rim:Name>
                <rim:LocalizedString value="XDSDocumentEntry.patientId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
            <rim:ExternalIdentifier id="uniqueId-0" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" registryObject="DocumentEntry-0" value="2.25.275698025730432209825743891039059232084">
              <rim:Name>
                <rim:LocalizedString value="XDSDocumentEntry.uniqueId"/>
              </rim:Name>
            </rim:ExternalIdentifier>
          </rim:ExtrinsicObject>
        </rim:RegistryObjectList>
      </lcm:SubmitObjectsRequest>
      <xdsb:Document id="DocumentEntry-0">
        <ns0:Include xmlns:ns0="http://www.w3.org/2004/08/xop/include" href="cid:Document0@PHRService.konlan"/>
      </xdsb:Document>
    </xdsb:ProvideAndRegisterDocumentSetRequest>
  </soap12:Body>
</soap12:Envelope>
